; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	spectrograph7 - mode
	thermograph2 - mode
	spectrograph1 - mode
	thermograph9 - mode
	image0 - mode
	image4 - mode
	infrared6 - mode
	thermograph8 - mode
	spectrograph5 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph8)
	(supports instrument0 infrared6)
	(supports instrument0 image4)
	(supports instrument0 image0)
	(supports instrument0 thermograph9)
	(supports instrument0 image3)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Phenomenon5 image3)
	(have_image Phenomenon5 thermograph8)
	(have_image Phenomenon5 thermograph2)
	(have_image Phenomenon6 thermograph8)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon6 spectrograph5)
	(have_image Star7 thermograph9)
	(have_image Planet8 infrared6)
	(have_image Star9 spectrograph5)
	(have_image Star9 spectrograph7)
	(have_image Star9 thermograph9)
	(have_image Planet10 image0)
	(have_image Planet10 image4)
	(have_image Planet10 thermograph8)
))

)

; plan
1. (turn_to satellite0 star0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star0)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 planet10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet10)
   goals met: 0 of 15
5. (take_image satellite0 planet10 instrument0 thermograph8)
   added: (have_image planet10 thermograph8)
   goals met: 1 of 15
6. (take_image satellite0 planet10 instrument0 image4)
   added: (have_image planet10 image4)
   goals met: 2 of 15
7. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 15
8. (turn_to satellite0 phenomenon6 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 15
9. (take_image satellite0 phenomenon6 instrument0 thermograph8)
   added: (have_image phenomenon6 thermograph8)
   goals met: 4 of 15
10. (take_image satellite0 phenomenon6 instrument0 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 5 of 15
11. (take_image satellite0 phenomenon6 instrument0 image3)
   added: (have_image phenomenon6 image3)
   goals met: 6 of 15
12. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 6 of 15
13. (take_image satellite0 phenomenon5 instrument0 thermograph2)
   added: (have_image phenomenon5 thermograph2)
   goals met: 7 of 15
14. (take_image satellite0 phenomenon5 instrument0 image3)
   added: (have_image phenomenon5 image3)
   goals met: 8 of 15
15. (take_image satellite0 phenomenon5 instrument0 thermograph8)
   added: (have_image phenomenon5 thermograph8)
   goals met: 9 of 15
16. (turn_to satellite0 planet8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet8)
   goals met: 9 of 15
17. (take_image satellite0 planet8 instrument0 infrared6)
   added: (have_image planet8 infrared6)
   goals met: 10 of 15
18. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 10 of 15
19. (take_image satellite0 star7 instrument0 thermograph9)
   added: (have_image star7 thermograph9)
   goals met: 11 of 15
20. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 12 of 15
21. (take_image satellite0 star9 instrument0 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 13 of 15
22. (take_image satellite0 star9 instrument0 spectrograph7)
   added: (have_image star9 spectrograph7)
   goals met: 14 of 15
23. (take_image satellite0 star9 instrument0 thermograph9)
   added: (have_image star9 thermograph9)
   goals met: 15 of 15
